# Trade - Offs in Missing Data Conventions

In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
for dtype in ["object","int"]:
    print("dtype:", dtype)
    %timeit np.arange(1E6, dtype = dtype).sum()
    print()

dtype: object
115 ms ± 22.3 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype: int
3.39 ms ± 343 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

## Missing Numerical Data

In [5]:
vals2 = np.array([1,np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [6]:
1+np.nan

nan

In [7]:
 0 * np.nan

nan

## NaN and None in Pandas

In [8]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [9]:
x = pd.Series(range(2), dtype = int)
x

0    0
1    1
dtype: int32

In [10]:
x[0] = None

In [11]:
x

0    NaN
1    1.0
dtype: float64

### Operating on Null Values

* isnull() : Generate a boolean mask indicating missing values
* notnull() : Opposite of isnull()
* dropna() : Return a filtered version of data
* fillna() : Return copy of data with missing values filled or imputed

In [12]:
data = pd.Series([1,np.nan, "Hello", None])
data

0        1
1      NaN
2    Hello
3     None
dtype: object

In [13]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [14]:
data[data.notnull()]

0        1
2    Hello
dtype: object

In [15]:
data.dropna()

0        1
2    Hello
dtype: object

In [17]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [19]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [20]:
df.dropna(axis="columns")

   2
0  2
1  5
2  6

In [21]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [22]:
df.dropna(axis="columns",how="all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [23]:
df.dropna(axis="rows",thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [24]:
### Filling Null Values

In [25]:
data = pd.Series([1,np.nan, 2,None,3], index = list("abcde"))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [26]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [27]:
data.fillna(method="ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [30]:
data.fillna(method = "bfill",inplace=True)

In [31]:
data

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [34]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [38]:
df.fillna(method = "ffill",axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0